//-----1

let age = +prompt("Введіть Ваш вік:");
if (age > 0 && age< 12){
    alert("Дитина");
}
else if (age >= 12 && age < 18){
    alert("Підліток");
}
else if (age >= 18 && age < 60){
    alert("Дорослий");
}
else if (age >= 60 ){
    alert("Пенсіонер");
}

//-----2

let number = +prompt("Введіть число від 0 до 9:");
switch(number){
    case 0: alert("Спецсимвол: ')'");
        break;
    case 1: alert("Спецсимвол: '!'");
        break;
    case 2: alert("Спецсимвол: '@'");
        break;
    case 3: alert("Спецсимвол: '#'");
        break;
    case 4: alert("Спецсимвол: '$'");
        break;
    case 5: alert("Спецсимвол: '%'");
        break;
    case 6: alert("Спецсимвол: '^'");
        break;
    case 7: alert("Спецсимвол: '&'");
        break
    case 8: alert("Спецсимвол: '*'");
        break;
    case 9: alert("Спецсимвол: '('");
        break;
}

//-----3

let n3 = +prompt("Введіть трьохзначне число:");
alert( (n3 % 10 == ((n3 - n3 % 100) / 100) || n3 % 10 == ((n3 % 100 - n3 % 10) / 10) || ((n3 % 100 - n3 % 10) / 10) == ((n3 - n3 % 100) / 100)) ? 'Наявні однакові цифри' : 'Відсутні однакові цифри');

//-----4

let year = +prompt("Введіит рік:");
alert((year % 400 == 0 || year % 4 == 0 && year % 100 != 0) ? 'Високосний рік' : 'Звичайний рік');

//-----5

let n5 = +prompt("Введіть п'ятирозрядне число:");
alert( (n5 % 10 == ((n5 - n5 % 10000) / 10000) && ((n5 % 100 - n5 % 10) / 10) == ((n5 % 10000- n5 % 1000) / 1000)) ? 'Число паліндром' : 'Число не паліндром');

//-----6

let sum = +prompt("Введіть суму $ :");
let currency = prompt("Введіть валюту(EUR, UAH, AZN):");
const eur = 0.82;
const uah = 27.53;
const azn = 1.69;
switch(currency){
    case 'EUR': alert(`Сума в EUR = ${sum * eur}`);
        break;
    case 'UAH': alert(`Сума в UAH = ${sum * uah}`);
        break;
    case 'AZN': alert(`Сума в AZN = ${sum * azn}`);
        break;
}

//-----7

let price = +prompt("Введіть суму покупки:");
if ( price < 200 ){
    alert(`Сума до оплати: ${price}`);
}
else if ( price >= 200 && price < 300 ){
    alert(`Сума до оплати: ${price - price * 0.03}`);
}
else if ( price >= 300 && price < 500 ){
    alert(`Сума до оплати: ${price - price * 0.05}`);
}
else if ( price >=500 ){
    alert(`Сума до оплати: ${price - price * 0.07}`);
}

//-----8
let c = +prompt("Введіть довжину кола:");
let p = +prompt("Введіть периметр квадрата:");
alert((p/4 >= c/Math.PI) ? 'Коло може бути вписане в квадрат' : 'Коло не може бути вписане в квадрат');

//-----9

let q1 = prompt("Столиця України: а)Київ; б)Львів; в)Рівне");
let q2 = prompt("Прапор України: а)зелено-білий; б)жовто-блакитний; в)біло-червоний");
let q3 = prompt("Герб України: а)Сокіл; б)Шабля; в)Тризуб");
if (q1 == 'а' && q2 == 'б' && q3 == 'в'){
    alert(`Сума балів: 6`);
}
else if (q1 == 'а' && q2 == 'б'){
    alert(`Сума балів: 4`);
}
else if (q1 == 'а' && q3 == 'в'){
    alert(`Сума балів: 4`);
}
else if (q2 == 'б' && q3 == 'в'){
    alert(`Сума балів: 4`);
}
else if (q1 == 'а' ){
    alert(`Сума балів: 2`);
}
else if (q2 == 'б' ){
    alert(`Сума балів: 2`);
}
else if (q3 == 'в' ){
    alert(`Сума балів: 2`);
}
else {
    alert(`Сума балів: 0`);
}

//-----10

let d = +prompt("Введіть число:");
let m = +prompt("Введіть місяць:");
let y = +prompt("Введіть рік:");

if ( d>=1 && d<= 29 && m==04 || d>=1 && d<= 29 && m==06 || d>=1 && d<= 29 && m==09){
    alert(`Наступна дата: ${++d}.0${m}.${y}`);
}
else if ( d>=1 && d<= 29 && m==11){
    alert(`Наступна дата: ${++d}.${m}.${y}`);
}
else if ( d == 30 && m==04 || d==30 && m==06){
    alert(`Наступна дата: 01.0${++m}.${y}`);
}
else if ( d==30 && m==09 || d==30 && m==11){
    alert(`Наступна дата: 01.${++m}.${y}`);
}

else if ( d>=1 && d<= 30 && m==01 || d>=1 && d<= 30 && m==03 || d>=1 && d<= 30 && m==05 || d>=1 && d<= 30 && m==07 || d>=1 && d<= 30 && m==08){
    alert(`Наступна дата: ${++d}.0${m}.${y}`);
}
else if ( d>=1 && d<= 30 && m==10 || d>=1 && d<= 30 && m==12){
    alert(`Наступна дата: ${++d}.${m}.${y}`);
}
else if ( d == 31 && m==01 || d==31 && m==03 || d==31 && m==05 || d==31 && m==07 || d==31 && m==08){
    alert(`Наступна дата: 01.0${++m}.${y}`);
}
else if ( d==31 && m==10){
    alert(`Наступна дата: 01.${++m}.${y}`);
}
else if ( d==31 && m==12){
    alert(`Наступна дата: 01.01.${++y}`);
}
else if ( d>=1 && d<=27 && m==02){
    alert(`Наступна дата: ${++d}.0${m}.${y}`);
}
else if ( d==28 && m==02 && y%4==0){
    alert(`Наступна дата: ${++d}.0${m}.${y}`);
}
else if ( d==28 && m==02 && y%4!=0){
    alert(`Наступна дата: 01.0${++m}.${y}`);
}
else if ( d==29 && m==02 && y%4==0){
    alert(`Наступна дата: 01.0${++m}.${y}`);
}
else{
    alert("Некоректно введена дата!");
}


